-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 05, 2026 at 11:31 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fitness_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `about_content`
--

CREATE TABLE `about_content` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `about_content`
--

INSERT INTO `about_content` (`id`, `title`, `description`, `image`, `updated_at`) VALUES
(1, 'Test', 'Test', 'uploads/about_698f51b5217b1.jpg', '2026-03-15 15:26:19');

-- --------------------------------------------------------

--
-- Table structure for table `admin_logs`
--

CREATE TABLE `admin_logs` (
  `id` int(11) NOT NULL,
  `admin_id` int(11) DEFAULT NULL,
  `admin_name` varchar(150) NOT NULL,
  `action_type` varchar(100) NOT NULL,
  `details` text NOT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `admin_logs`
--

INSERT INTO `admin_logs` (`id`, `admin_id`, `admin_name`, `action_type`, `details`, `ip_address`, `created_at`) VALUES
(1, 9, 'ไม่บอก', 'นำเข้าล็อตสินค้า', 'นำเข้าล็อตสินค้าใหม่สำหรับสินค้า: Teto (รหัส #32): เลขล็อต = TOL-002, ต้นทุน = ฿50, ราคาขาย = ฿75, จำนวน = 10', '::1', '2026-05-30 17:04:47'),
(2, 10, 's', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: s', '::1', '2026-05-30 17:37:34'),
(3, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-05-30 17:37:57'),
(4, 9, 'ไม่บอก', 'แก้ไขสมาชิก', 'แก้ไขข้อมูลสมาชิก ID #10: ชื่อ = s, อีเมล = ppilovee02@gmail.com, สิทธิ์ = user, แต้มสะสม = 50', '::1', '2026-05-30 17:38:20'),
(5, 10, 's', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: s', '::1', '2026-05-30 17:38:33'),
(6, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-05-30 17:38:50'),
(7, 9, 'ไม่บอก', 'สร้างคูปอง', 'สร้างคูปองส่วนลดโค้ด 5.5: ประเภท = fixed, มูลค่า = 50, ยอดซื้อขั้นต่ำ = 100, วันหมดอายุ = 2026-07-01', '::1', '2026-05-31 05:35:14'),
(8, 9, 'ไม่บอก', 'แก้ไขคูปอง', 'แก้ไขคูปองส่วนลด ID #11: โค้ด = 5.5, ประเภท = fixed, มูลค่า = 50, ยอดซื้อขั้นต่ำ = 100, วันเริ่มใช้งาน = 2026-06-05 00:00:00, วันหมดอายุ = 2026-07-01 23:59:00', '::1', '2026-05-31 05:46:41'),
(9, 1, 'System', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-02 07:31:27'),
(10, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-06-02 07:32:20'),
(11, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (none)', '::1', '2026-06-02 07:35:45'),
(12, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-02 07:36:01'),
(13, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (none)', '::1', '2026-06-02 07:46:19'),
(14, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #43 ยอดชำระสุทธิ: ฿54.00 (ใช้คูปอง: FREE)', '::1', '2026-06-02 07:46:27'),
(15, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-02 07:47:16'),
(16, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', 'เปลี่ยนสถานะออเดอร์ #43 เป็น cancelled', '::1', '2026-06-02 07:47:54'),
(17, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-02 07:48:45'),
(18, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-02 07:48:50'),
(19, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-02 07:49:51'),
(20, 9, 'ไม่บอก', 'เพิ่มที่อยู่', 'ลูกค้าเพิ่มที่อยู่จัดส่งใหม่: คมสัน บุญเขียน (0919922031) - ที่อยู่: 107 หมู่7  เชียงเครือ เมืองสกลนคร สกลนคร 47000', '::1', '2026-06-03 07:06:46'),
(21, 9, 'ไม่บอก', 'ลบที่อยู่', 'ลูกค้าลบที่อยู่จัดส่ง ID #13 ของคุณ คมสัน  (0919922031)', '::1', '2026-06-03 07:06:58'),
(22, 9, 'ไม่บอก', 'ลบที่อยู่', 'ลูกค้าลบที่อยู่จัดส่ง ID #16 ของคุณ คมสัน  (0919922031)', '::1', '2026-06-03 07:07:00'),
(23, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #44 ยอดชำระสุทธิ: ฿0.00 (ใช้คูปอง: FREE) (ใช้แต้มลด: 50 แต้ม)', '::1', '2026-06-03 07:07:21'),
(24, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', 'เปลี่ยนสถานะออเดอร์ #44 เป็น shipping', '::1', '2026-06-03 07:07:47'),
(25, 9, 'ไม่บอก', 'เพิ่มที่อยู่', 'ลูกค้าเพิ่มที่อยู่จัดส่งใหม่: DD (0919922031) - ที่อยู่: 104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '::1', '2026-06-03 07:11:51'),
(26, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-04 04:57:40'),
(27, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-04 04:57:59'),
(28, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', 'แก้ไขข้อมูลร้านค้า, ระบบ SMTP, อัตราแต้มสะสม (100 บาท/แต้ม, 1 บาท/แต้ม), LINE Notify และตั้งค่าสแกนสลิปด้วย AI (gemini)', '::1', '2026-06-04 04:58:08'),
(29, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', '{\"title\":\"แก้ไขการตั้งค่าระบบและข้อมูลร้านค้า\",\"changes\":[{\"field\":\"ชื่อร้านค้า\",\"old\":\"Por Mae Bet Taled\",\"new\":\"Por Mae Bet Taled ก\"}]}', '::1', '2026-06-04 06:36:08'),
(30, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', '{\"title\":\"แก้ไขการตั้งค่าระบบและข้อมูลร้านค้า\",\"changes\":[{\"field\":\"ชื่อร้านค้า\",\"old\":\"Por Mae Bet Taled ก\",\"new\":\"Por Mae Bet Taled\"}]}', '::1', '2026-06-04 06:42:25'),
(31, 9, 'ไม่บอก', 'แก้ไขสมาชิก', '{\"title\":\"แก้ไขข้อมูลสมาชิก ID #9 (Username: a)\",\"changes\":[{\"field\":\"คะแนนสะสม (Points)\",\"old\":\"1,450 แต้ม\",\"new\":\"150 แต้ม\"}]}', '::1', '2026-06-04 06:43:45'),
(32, 9, 'ไม่บอก', 'เพิ่มสินค้า', '{\"title\":\"เพิ่มสินค้าใหม่ \'Miku\' (รหัส #33)\",\"changes\":[{\"field\":\"ชื่อสินค้า\",\"old\":\"-\",\"new\":\"Miku\"},{\"field\":\"หมวดหมู่\",\"old\":\"-\",\"new\":\"ยาสามัญประจำบ้าน\"},{\"field\":\"คำอธิบายสินค้า\",\"old\":\"-\",\"new\":\"\"},{\"field\":\"ตัวเลือกสินค้า\",\"old\":\"-\",\"new\":\"\"}],\"sections\":[{\"title\":\"คลังสินค้าเริ่มต้นที่บันทึก\",\"items\":[\"เลขล็อต = 01, ต้นทุน = ฿50, ราคาขาย = ฿70, จำนวน = 50 ชิ้น\"]}]}', '::1', '2026-06-04 06:45:08'),
(33, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #45 ยอดชำระสุทธิ: ฿174.00 (ใช้คูปอง: FREE)', '::1', '2026-06-04 09:53:13'),
(34, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #46 ยอดชำระสุทธิ: ฿63.00 (ใช้คูปอง: FREE)', '::1', '2026-06-04 09:57:37'),
(35, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #47 ยอดชำระสุทธิ: ฿123.00 (ใช้คูปอง: SALE10)', '::1', '2026-06-04 13:03:41'),
(36, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #47 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿123.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:03:56'),
(37, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #46 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿63.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:03:58'),
(38, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #45 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿174.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:04:04'),
(39, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #48 ยอดชำระสุทธิ: ฿179.00 (ใช้คูปอง: FREE)', '::1', '2026-06-04 13:04:27'),
(40, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #48 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿179.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:06:27'),
(41, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #49 ยอดชำระสุทธิ: ฿130.00', '::1', '2026-06-04 13:06:57'),
(42, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #48 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿179.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"คำสั่งซื้อถูกยกเลิก\",\"new\":\"รอตรวจสอบชำระเงิน\"}]}', '::1', '2026-06-04 13:07:11'),
(43, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #48 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿179.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:07:15'),
(44, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #49 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿130.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:08:52'),
(45, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #50 ยอดชำระสุทธิ: ฿130.00', '::1', '2026-06-04 13:09:03'),
(46, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #51 ยอดชำระสุทธิ: ฿110.00', '::1', '2026-06-04 13:09:55'),
(47, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #51 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿110.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:11:23'),
(48, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #50 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿130.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:11:24'),
(49, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #50 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿130.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"คำสั่งซื้อถูกยกเลิก\",\"new\":\"รอตรวจสอบชำระเงิน\"}]}', '::1', '2026-06-04 13:11:26'),
(50, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #50 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿130.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อถูกยกเลิก\"}]}', '::1', '2026-06-04 13:11:27'),
(51, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #52 ยอดชำระสุทธิ: ฿110.00', '::1', '2026-06-04 13:12:56'),
(52, 9, 'ไม่บอก', 'สั่งซื้อสินค้า', 'ลูกค้าสั่งซื้อสินค้าสำเร็จ ใบสั่งซื้อ #53 ยอดชำระสุทธิ: ฿110.00', '::1', '2026-06-04 13:13:43'),
(53, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #53 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿110.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อสำเร็จ\"}]}', '::1', '2026-06-04 13:13:51'),
(54, 9, 'ไม่บอก', 'อัปเดตสถานะออเดอร์', '{\"title\":\"อัปเดตสถานะคำสั่งซื้อ #52 (ลูกค้า: ไม่บอก, ยอดสุทธิ: ฿110.00)\",\"changes\":[{\"field\":\"สถานะคำสั่งซื้อ\",\"old\":\"รอตรวจสอบชำระเงิน\",\"new\":\"คำสั่งซื้อสำเร็จ\"}]}', '::1', '2026-06-04 13:13:53'),
(55, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', '{\"title\":\"แก้ไขการตั้งค่าระบบและข้อมูลร้านค้า\",\"changes\":[{\"field\":\"ผู้ให้บริการ Slip AI\",\"old\":\"gemini\",\"new\":\"none\"}]}', '::1', '2026-06-04 15:07:47'),
(56, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', '{\"title\":\"แก้ไขการตั้งค่าระบบและข้อมูลร้านค้า\",\"changes\":[{\"field\":\"ผู้ให้บริการ Slip AI\",\"old\":\"none\",\"new\":\"gemini\"}]}', '::1', '2026-06-04 15:07:50'),
(57, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', '{\"title\":\"แก้ไขการตั้งค่าระบบและข้อมูลร้านค้า\",\"changes\":[]}', '::1', '2026-06-04 15:26:12'),
(58, 9, 'ไม่บอก', 'แก้ไขตั้งค่าร้านค้า', '{\"title\":\"แก้ไขการตั้งค่าระบบและข้อมูลร้านค้า\",\"changes\":[{\"field\":\"ผู้ให้บริการ Slip AI\",\"old\":\"gemini\",\"new\":\"none\"}]}', '::1', '2026-06-04 15:26:14'),
(59, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-06-04 16:41:13'),
(60, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-06-04 17:13:58'),
(61, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-06-04 17:18:53'),
(62, 9, 'ไม่บอก', 'เข้าสู่ระบบ', 'ลูกค้าเข้าสู่ระบบสำเร็จ ชื่อผู้ใช้: a', '::1', '2026-06-04 17:22:12'),
(63, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง\'\",\"details\":\"สินค้า: ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง (ID #27), ราคา: ฿41 (ส่วนลด 10% แบบ static), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:26:22, สิ้นสุด: 2026-06-05 13:26:22\"}', '', '2026-06-05 05:39:19'),
(64, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.\'\",\"details\":\"สินค้า: ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก. (ID #29), ราคา: ฿225 (ส่วนลด 10% แบบ static), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:26:22, สิ้นสุด: 2026-06-05 13:26:22\"}', '', '2026-06-05 05:39:19'),
(65, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง\'\",\"details\":\"สินค้า: ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง (ID #27), ราคา: ฿41 (ส่วนลด 10% แบบ static), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:26:22, สิ้นสุด: 2026-06-05 14:26:22\"}', '', '2026-06-05 05:39:19'),
(66, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม\'\",\"details\":\"สินค้า: อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม (ID #28), ราคา: ฿32 (ส่วนลด 10% แบบ static), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:26:22, สิ้นสุด: 2026-06-05 14:26:22\"}', '', '2026-06-05 05:39:19'),
(67, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'Miku\'\",\"details\":\"สินค้า: Miku (ID #33), ราคา: ฿63 (ส่วนลด 10% แบบ static), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:26:22, สิ้นสุด: 2026-06-05 14:26:22\"}', '', '2026-06-05 05:39:19'),
(68, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม\'\",\"details\":\"สินค้า: อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม (ID #28), ราคา: ฿22 (ส่วนลด 40% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:39:20, สิ้นสุด: 2026-06-05 14:39:20\"}', '', '2026-06-05 05:39:20'),
(69, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.\'\",\"details\":\"สินค้า: ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก. (ID #29), ราคา: ฿150 (ส่วนลด 40% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:39:20, สิ้นสุด: 2026-06-05 14:39:20\"}', '', '2026-06-05 05:39:20'),
(70, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม\'\",\"details\":\"สินค้า: อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม (ID #28), ราคา: ฿22 (ส่วนลด 40% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 14:39:20, สิ้นสุด: 2026-06-05 16:39:20\"}', '', '2026-06-05 05:39:20'),
(71, NULL, 'System', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.\'\",\"details\":\"สินค้า: ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก. (ID #29), ราคา: ฿150 (ส่วนลด 40% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 14:39:20, สิ้นสุด: 2026-06-05 16:39:20\"}', '', '2026-06-05 05:39:20'),
(72, 9, 'ไม่บอก', 'ตั้งค่า Flash Sale อัตโนมัติ', '{\"title\":\"อัปเดตการตั้งค่าระบบ Flash Sale อัตโนมัติ\",\"changes\":[{\"field\":\"เปิดใช้งานระบบอัตโนมัติ\",\"old\":\"ปิด\",\"new\":\"เปิด\"},{\"field\":\"ประเภทส่วนลด\",\"old\":\"dynamic\",\"new\":\"dynamic\"},{\"field\":\"ส่วนลดอัตโนมัติ (%)\",\"old\":\"10%\",\"new\":\"10%\"},{\"field\":\"ส่วนลดขั้นต่ำ Dynamic (%)\",\"old\":\"15%\",\"new\":\"10%\"},{\"field\":\"ส่วนลดขั้นสูง Dynamic (%)\",\"old\":\"40%\",\"new\":\"30%\"},{\"field\":\"กฎการเลือกสินค้า\",\"old\":\"slow_moving\",\"new\":\"slow_moving\"},{\"field\":\"จำนวนสินค้าต่อรอบ\",\"old\":\"2\",\"new\":4},{\"field\":\"ระยะเวลารอบ (ชม.)\",\"old\":\"2 ชม.\",\"new\":\"1 ชม.\"}]}', '::1', '2026-06-05 05:41:48'),
(73, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม\'\",\"details\":\"สินค้า: อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม (ID #28), ราคา: ฿25 (ส่วนลด 30% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:41:48, สิ้นสุด: 2026-06-05 13:41:48\"}', '::1', '2026-06-05 05:41:48'),
(74, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.\'\",\"details\":\"สินค้า: ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก. (ID #29), ราคา: ฿175 (ส่วนลด 30% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:41:48, สิ้นสุด: 2026-06-05 13:41:48\"}', '::1', '2026-06-05 05:41:48'),
(75, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง\'\",\"details\":\"สินค้า: ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง (ID #27), ราคา: ฿33 (ส่วนลด 28% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:41:48, สิ้นสุด: 2026-06-05 13:41:48\"}', '::1', '2026-06-05 05:41:48'),
(76, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'น้ำดื่มคริสตัลขนาด (1500 มล. x 6 ขวด)\'\",\"details\":\"สินค้า: น้ำดื่มคริสตัลขนาด (1500 มล. x 6 ขวด) (ID #30), ราคา: ฿46 (ส่วนลด 23% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 12:41:48, สิ้นสุด: 2026-06-05 13:41:48\"}', '::1', '2026-06-05 05:41:48'),
(77, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม\'\",\"details\":\"สินค้า: อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม (ID #28), ราคา: ฿25 (ส่วนลด 30% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 14:41:48\"}', '::1', '2026-06-05 05:41:48'),
(78, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.\'\",\"details\":\"สินค้า: ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก. (ID #29), ราคา: ฿175 (ส่วนลด 30% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 14:41:48\"}', '::1', '2026-06-05 05:41:48'),
(79, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง\'\",\"details\":\"สินค้า: ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง (ID #27), ราคา: ฿33 (ส่วนลด 28% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 14:41:48\"}', '::1', '2026-06-05 05:41:48'),
(80, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'น้ำดื่มคริสตัลขนาด (1500 มล. x 6 ขวด)\'\",\"details\":\"สินค้า: น้ำดื่มคริสตัลขนาด (1500 มล. x 6 ขวด) (ID #30), ราคา: ฿46 (ส่วนลด 23% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 14:41:48\"}', '::1', '2026-06-05 05:41:48'),
(81, 9, 'ไม่บอก', 'ตั้งค่า Flash Sale อัตโนมัติ', '{\"title\":\"อัปเดตการตั้งค่าระบบ Flash Sale อัตโนมัติ\",\"changes\":[{\"field\":\"เปิดใช้งานระบบอัตโนมัติ\",\"old\":\"เปิด\",\"new\":\"เปิด\"},{\"field\":\"ประเภทส่วนลด\",\"old\":\"dynamic\",\"new\":\"dynamic\"},{\"field\":\"ส่วนลดอัตโนมัติ (%)\",\"old\":\"10%\",\"new\":\"10%\"},{\"field\":\"ส่วนลดขั้นต่ำ Dynamic (%)\",\"old\":\"10%\",\"new\":\"10%\"},{\"field\":\"ส่วนลดขั้นสูง Dynamic (%)\",\"old\":\"30%\",\"new\":\"30%\"},{\"field\":\"กฎการเลือกสินค้า\",\"old\":\"slow_moving\",\"new\":\"slow_moving\"},{\"field\":\"จำนวนสินค้าต่อรอบ\",\"old\":\"4\",\"new\":4},{\"field\":\"ระยะเวลารอบ (ชม.)\",\"old\":\"1 ชม.\",\"new\":\"4 ชม.\"},{\"field\":\"โควตาสินค้าอัตโนมัติ (ชิ้น)\",\"old\":\"10 ชิ้น\",\"new\":\"10 ชิ้น\"}]}', '::1', '2026-06-05 05:57:39'),
(82, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'Miku\'\",\"details\":\"สินค้า: Miku (ID #33), ราคา: ฿56 (ส่วนลด 20% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 17:41:48\"}', '::1', '2026-06-05 05:57:39'),
(83, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'จอห์นสัน เบบี้ ครีมอาบน้ำและสระผมเด็ก เบดไทม์ เซล์ฟ โฟมมิ่ง โฟมมิ่ง วอช 400 มล.\'\",\"details\":\"สินค้า: จอห์นสัน เบบี้ ครีมอาบน้ำและสระผมเด็ก เบดไทม์ เซล์ฟ โฟมมิ่ง โฟมมิ่ง วอช 400 มล. (ID #31), ราคา: ฿169 (ส่วนลด 15% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 17:41:48\"}', '::1', '2026-06-05 05:57:39'),
(84, 9, 'ไม่บอก', 'ระบบสุ่ม Flash Sale อัตโนมัติ', '{\"title\":\"สร้างแคมเปญ Flash Sale อัตโนมัติสำเร็จสำหรับสินค้า \'Teto\'\",\"details\":\"สินค้า: Teto (ID #32), ราคา: ฿45 (ส่วนลด 10% แบบ dynamic), โควตา: 10 ชิ้น, เริ่มต้น: 2026-06-05 13:41:48, สิ้นสุด: 2026-06-05 17:41:48\"}', '::1', '2026-06-05 05:57:39');

-- --------------------------------------------------------

--
-- Table structure for table `banners`
--

CREATE TABLE `banners` (
  `id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `banners`
--

INSERT INTO `banners` (`id`, `image`, `created_at`) VALUES
(18, 'uploads/banner_69b6d5ccbd7fe.jpg', '2026-03-15 15:52:44'),
(19, 'uploads/banner_69b97435e2fe4.jpg', '2026-03-26 19:30:56');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(6, 'อาหารแห้งและเครื่องปรุง'),
(7, 'เครื่องดื่มและขนม'),
(8, 'ของใช้ส่วนตัว'),
(9, 'อุปกรณ์ทำความสะอาด'),
(10, 'ยาสามัญประจำบ้าน'),
(11, 'เครื่องเขียนและอุปกรณ์สำนักงาน'),
(12, 'เบ็ดเตล็ดอื่นๆ ในครัวเรือน');

-- --------------------------------------------------------

--
-- Table structure for table `contact_messages`
--

CREATE TABLE `contact_messages` (
  `id` int(11) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `subject` varchar(200) DEFAULT NULL,
  `message` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `status` enum('unread','read') DEFAULT 'unread'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `contact_messages`
--

INSERT INTO `contact_messages` (`id`, `name`, `email`, `subject`, `message`, `created_at`, `status`) VALUES
(1, 'komsan bonkelan', 'ppilovee01@gmail.com', 'คอมเสีย', 'ไม่บอก', '2026-02-16 15:28:01', 'read');

-- --------------------------------------------------------

--
-- Table structure for table `coupons`
--

CREATE TABLE `coupons` (
  `id` int(11) NOT NULL,
  `code` varchar(50) NOT NULL,
  `discount_type` enum('fixed','percent','free_shipping') NOT NULL,
  `discount_value` decimal(10,2) NOT NULL,
  `min_spend` decimal(10,2) DEFAULT 0.00,
  `usage_limit` int(11) DEFAULT 0,
  `user_limit` int(11) DEFAULT 0,
  `start_date` datetime DEFAULT NULL,
  `expiry_date` datetime DEFAULT NULL,
  `status` enum('active','inactive') DEFAULT 'active',
  `max_discount` decimal(10,2) DEFAULT 0.00
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `coupons`
--

INSERT INTO `coupons` (`id`, `code`, `discount_type`, `discount_value`, `min_spend`, `usage_limit`, `user_limit`, `start_date`, `expiry_date`, `status`, `max_discount`) VALUES
(1, 'WELCOME100', 'fixed', 100.00, 500.00, 0, 0, NULL, '2026-02-28 23:59:59', 'active', 0.00),
(2, 'SALE10', 'percent', 10.00, 0.00, 0, 0, NULL, '2026-12-31 23:59:59', 'active', 0.00),
(3, 'เอก', 'fixed', 5000.00, 0.00, 0, 0, NULL, '2026-02-26 23:59:59', 'active', 0.00),
(6, 'W', 'fixed', 50.00, 0.00, 0, 0, NULL, '2026-01-02 23:59:59', 'active', 0.00),
(8, 'D', 'percent', 12.00, 0.00, 500, 3, NULL, '2026-06-28 23:59:59', 'active', 0.00),
(9, 'NEWUSER', 'percent', 30.00, 100.00, 2147483647, 1, NULL, '2027-01-01 23:59:59', 'active', 100.00),
(10, 'FREE', 'free_shipping', 0.00, 0.00, 2147483647, 3, NULL, '2026-10-01 23:59:59', 'active', 0.00),
(11, '5.5', 'fixed', 50.00, 100.00, 0, 1, '2026-06-05 00:00:00', '2026-07-01 23:59:00', 'active', 0.00);

-- --------------------------------------------------------

--
-- Table structure for table `feedback`
--

CREATE TABLE `feedback` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `message` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `feedback`
--

INSERT INTO `feedback` (`id`, `user_id`, `message`, `created_at`) VALUES
(1, 9, 'กาก', '2026-02-09 17:34:47'),
(2, 9, 'ไม่บอก', '2026-02-09 17:56:47');

-- --------------------------------------------------------

--
-- Table structure for table `flash_sales`
--

CREATE TABLE `flash_sales` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `flash_price` decimal(10,2) NOT NULL,
  `flash_stock` int(11) NOT NULL,
  `flash_sold` int(11) DEFAULT 0,
  `start_time` datetime NOT NULL,
  `end_time` datetime NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `flash_sales`
--

INSERT INTO `flash_sales` (`id`, `product_id`, `flash_price`, `flash_stock`, `flash_sold`, `start_time`, `end_time`, `created_at`) VALUES
(70, 28, 25.00, 10, 0, '2026-06-05 12:41:48', '2026-06-05 13:41:48', '2026-06-05 05:41:48'),
(71, 29, 175.00, 10, 0, '2026-06-05 12:41:48', '2026-06-05 13:41:48', '2026-06-05 05:41:48'),
(72, 27, 33.00, 10, 0, '2026-06-05 12:41:48', '2026-06-05 13:41:48', '2026-06-05 05:41:48'),
(73, 30, 46.00, 10, 0, '2026-06-05 12:41:48', '2026-06-05 13:41:48', '2026-06-05 05:41:48'),
(74, 28, 25.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 14:41:48', '2026-06-05 05:41:48'),
(75, 29, 175.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 14:41:48', '2026-06-05 05:41:48'),
(76, 27, 33.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 14:41:48', '2026-06-05 05:41:48'),
(77, 30, 46.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 14:41:48', '2026-06-05 05:41:48'),
(78, 33, 56.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 17:41:48', '2026-06-05 05:57:39'),
(79, 31, 169.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 17:41:48', '2026-06-05 05:57:39'),
(80, 32, 45.00, 10, 0, '2026-06-05 13:41:48', '2026-06-05 17:41:48', '2026-06-05 05:57:39');

-- --------------------------------------------------------

--
-- Table structure for table `notifications`
--

CREATE TABLE `notifications` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `message` text NOT NULL,
  `url` varchar(255) DEFAULT NULL,
  `is_read` tinyint(1) DEFAULT 0,
  `is_admin` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `notifications`
--

INSERT INTO `notifications` (`id`, `user_id`, `title`, `message`, `url`, `is_read`, `is_admin`, `created_at`) VALUES
(1, 10, 'อัปเดตสถานะคำสั่งซื้อ #33', 'คำสั่งซื้อหมายเลข #33 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 1, 0, '2026-05-29 08:41:10'),
(2, 9, 'อัปเดตสถานะคำสั่งซื้อ #32', 'คำสั่งซื้อหมายเลข #32 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:14'),
(3, 9, 'อัปเดตสถานะคำสั่งซื้อ #31', 'คำสั่งซื้อหมายเลข #31 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:19'),
(4, 9, 'อัปเดตสถานะคำสั่งซื้อ #30', 'คำสั่งซื้อหมายเลข #30 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:23'),
(5, 9, 'อัปเดตสถานะคำสั่งซื้อ #29', 'คำสั่งซื้อหมายเลข #29 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:27'),
(6, 9, 'อัปเดตสถานะคำสั่งซื้อ #28', 'คำสั่งซื้อหมายเลข #28 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:32'),
(7, 9, 'อัปเดตสถานะคำสั่งซื้อ #27', 'คำสั่งซื้อหมายเลข #27 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:36'),
(8, 9, 'อัปเดตสถานะคำสั่งซื้อ #34', 'คำสั่งซื้อหมายเลข #34 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:41:39'),
(9, 9, 'อัปเดตสถานะคำสั่งซื้อ #22', 'คำสั่งซื้อหมายเลข #22 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:43:21'),
(10, 9, 'อัปเดตสถานะคำสั่งซื้อ #16', 'คำสั่งซื้อหมายเลข #16 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:43:30'),
(11, 9, 'อัปเดตสถานะคำสั่งซื้อ #15', 'คำสั่งซื้อหมายเลข #15 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:43:34'),
(12, 10, 'อัปเดตสถานะคำสั่งซื้อ #14', 'คำสั่งซื้อหมายเลข #14 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 1, 0, '2026-05-29 08:43:39'),
(13, 9, 'อัปเดตสถานะคำสั่งซื้อ #12', 'คำสั่งซื้อหมายเลข #12 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:43:52'),
(14, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #35', 'มีคำสั่งซื้อใหม่เข้ามา #35 จากคุณ คมสัน  ยอดชำระ ฿350', 'admin_orders.php', 1, 1, '2026-05-29 08:44:21'),
(15, 9, 'อัปเดตสถานะคำสั่งซื้อ #35', 'คำสั่งซื้อหมายเลข #35 ของคุณเปลี่ยนสถานะเป็น: กำลังจัดส่งสินค้า', 'my_orders.php', 0, 0, '2026-05-29 08:49:12'),
(16, 9, 'อัปเดตสถานะคำสั่งซื้อ #35', 'คำสั่งซื้อหมายเลข #35 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-29 08:49:49'),
(17, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #36', 'มีคำสั่งซื้อใหม่เข้ามา #36 จากคุณ คมสัน  ยอดชำระ ฿199', 'admin_orders.php', 1, 1, '2026-05-29 08:50:04'),
(18, 10, 'อัปเดตสถานะคำสั่งซื้อ #36', 'คำสั่งซื้อหมายเลข #36 ของคุณเปลี่ยนสถานะเป็น: กำลังจัดส่งสินค้า', 'my_orders.php', 1, 0, '2026-05-29 08:50:17'),
(19, 10, 'คำสั่งซื้อ #36 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #36 ของคุณได้รับการจัดส่งแล้ว! เลขพัสดุของคุณคือ: TH123525423', 'my_orders.php', 1, 0, '2026-05-29 08:50:48'),
(20, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #37', 'มีคำสั่งซื้อใหม่เข้ามา #37 จากคุณ คมสัน  ยอดชำระ ฿36', 'admin_orders.php', 1, 1, '2026-05-29 17:23:48'),
(21, 9, 'อัปเดตสถานะคำสั่งซื้อ #37', 'คำสั่งซื้อหมายเลข #37 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-05-29 17:24:12'),
(22, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #38', 'มีคำสั่งซื้อใหม่เข้ามา #38 จากคุณ คมสัน  ยอดชำระ ฿53', 'admin_orders.php', 1, 1, '2026-05-29 17:34:30'),
(23, 9, 'อัปเดตสถานะคำสั่งซื้อ #38', 'คำสั่งซื้อหมายเลข #38 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-05-29 17:34:55'),
(24, 9, 'คำสั่งซื้อ #38 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #38 ของคุณได้รับการจัดส่งแล้ว! เลขพัสดุของคุณคือ: TH 451245 441245', 'my_orders.php', 0, 0, '2026-05-29 17:35:56'),
(25, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #39', 'มีคำสั่งซื้อใหม่เข้ามา #39 จากคุณ คมสัน  ยอดชำระ ฿50', 'admin_orders.php', 1, 1, '2026-05-29 17:51:40'),
(26, NULL, 'สินค้าใกล้หมดคลัง: Teto', 'สินค้า Teto เหลือในคลังเพียง 4 ชิ้น กรุณาตรวจสอบและเติมสต๊อก', 'admin.php', 1, 1, '2026-05-29 17:52:15'),
(27, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #40', 'มีคำสั่งซื้อใหม่เข้ามา #40 จากคุณ คมสัน  ยอดชำระ ฿50', 'admin_orders.php', 1, 1, '2026-05-29 17:52:16'),
(28, NULL, 'สินค้าใกล้หมดคลัง: Teto', 'สินค้า Teto เหลือในคลังเพียง 2 ชิ้น กรุณาตรวจสอบและเติมสต๊อก', 'admin.php', 1, 1, '2026-05-29 18:44:21'),
(29, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #41', 'มีคำสั่งซื้อใหม่เข้ามา #41 จากคุณ คมสัน  ยอดชำระ ฿90', 'admin_orders.php', 1, 1, '2026-05-29 18:44:22'),
(30, 9, 'อัปเดตสถานะคำสั่งซื้อ #41', 'คำสั่งซื้อหมายเลข #41 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-05-29 18:44:37'),
(31, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #42', 'มีคำสั่งซื้อใหม่เข้ามา #42 จากคุณ คมสัน  ยอดชำระ ฿102', 'admin_orders.php', 1, 1, '2026-05-30 13:30:14'),
(32, 2, 'อัปเดตสถานะคำสั่งซื้อ #5', 'คำสั่งซื้อหมายเลข #5 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 13:55:28'),
(33, 9, 'อัปเดตสถานะคำสั่งซื้อ #41', 'คำสั่งซื้อหมายเลข #41 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 13:55:30'),
(34, 2, 'อัปเดตสถานะคำสั่งซื้อ #4', 'คำสั่งซื้อหมายเลข #4 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 13:56:21'),
(35, 2, 'อัปเดตสถานะคำสั่งซื้อ #3', 'คำสั่งซื้อหมายเลข #3 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 13:59:14'),
(36, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-05-30 14:11:02'),
(37, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: กำลังจัดส่งสินค้า', 'my_orders.php', 0, 0, '2026-05-30 14:11:10'),
(38, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-05-30 14:11:53'),
(39, 9, 'อัปเดตสถานะคำสั่งซื้อ #41', 'คำสั่งซื้อหมายเลข #41 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-05-30 14:11:58'),
(40, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: กำลังจัดส่งสินค้า', 'my_orders.php', 0, 0, '2026-05-30 14:15:02'),
(41, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-05-30 14:17:17'),
(42, 9, 'อัปเดตสถานะคำสั่งซื้อ #41', 'คำสั่งซื้อหมายเลข #41 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 14:20:50'),
(43, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 14:20:55'),
(44, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-05-30 14:28:19'),
(45, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-05-30 14:35:36'),
(46, 9, 'อัปเดตสถานะคำสั่งซื้อ #42', 'คำสั่งซื้อหมายเลข #42 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-05-30 15:30:56'),
(47, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย บริการขนส่งหลัก! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 15:41:55'),
(48, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย ไปรษณีย์ไทย! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 15:42:03'),
(49, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย Kerry Express! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 15:47:13'),
(50, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย Flash Express! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 15:49:42'),
(51, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย J&T Express! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 15:50:02'),
(52, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย KEX Express! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 16:00:38'),
(53, 9, 'คำสั่งซื้อ #42 ถูกจัดส่งแล้ว', 'คำสั่งซื้อหมายเลข #42 ของคุณได้รับการจัดส่งแล้วโดย KEX Express! เลขพัสดุของคุณคือ: ED140802776TH', 'my_orders.php', 0, 0, '2026-05-30 16:01:05'),
(54, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #43', 'มีคำสั่งซื้อใหม่เข้ามา #43 จากคุณ คมสัน  ยอดชำระ ฿54', 'admin_orders.php', 1, 1, '2026-06-02 07:46:27'),
(55, 9, 'อัปเดตสถานะคำสั่งซื้อ #43', 'คำสั่งซื้อหมายเลข #43 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-02 07:47:54'),
(56, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #44', 'มีคำสั่งซื้อใหม่เข้ามา #44 จากคุณ คมสัน บุญเขียน ยอดชำระ ฿0', 'admin_orders.php', 1, 1, '2026-06-03 07:07:21'),
(57, 9, 'อัปเดตสถานะคำสั่งซื้อ #44', 'คำสั่งซื้อหมายเลข #44 ของคุณเปลี่ยนสถานะเป็น: กำลังจัดส่งสินค้า', 'my_orders.php', 0, 0, '2026-06-03 07:07:47'),
(58, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #45', 'มีคำสั่งซื้อใหม่เข้ามา #45 จากคุณ DD ยอดชำระ ฿174', 'admin_orders.php', 1, 1, '2026-06-04 09:53:13'),
(59, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #46', 'มีคำสั่งซื้อใหม่เข้ามา #46 จากคุณ DD ยอดชำระ ฿63', 'admin_orders.php', 1, 1, '2026-06-04 09:57:37'),
(60, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #47', 'มีคำสั่งซื้อใหม่เข้ามา #47 จากคุณ DD ยอดชำระ ฿123', 'admin_orders.php', 1, 1, '2026-06-04 13:03:41'),
(61, 9, 'อัปเดตสถานะคำสั่งซื้อ #47', 'คำสั่งซื้อหมายเลข #47 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:03:56'),
(62, 9, 'อัปเดตสถานะคำสั่งซื้อ #46', 'คำสั่งซื้อหมายเลข #46 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:03:58'),
(63, 9, 'อัปเดตสถานะคำสั่งซื้อ #45', 'คำสั่งซื้อหมายเลข #45 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:04:04'),
(64, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #48', 'มีคำสั่งซื้อใหม่เข้ามา #48 จากคุณ DD ยอดชำระ ฿179', 'admin_orders.php', 1, 1, '2026-06-04 13:04:27'),
(65, 9, 'อัปเดตสถานะคำสั่งซื้อ #48', 'คำสั่งซื้อหมายเลข #48 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:06:27'),
(66, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #49', 'มีคำสั่งซื้อใหม่เข้ามา #49 จากคุณ DD ยอดชำระ ฿130', 'admin_orders.php', 1, 1, '2026-06-04 13:06:57'),
(67, 9, 'อัปเดตสถานะคำสั่งซื้อ #48', 'คำสั่งซื้อหมายเลข #48 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-06-04 13:07:11'),
(68, 9, 'อัปเดตสถานะคำสั่งซื้อ #48', 'คำสั่งซื้อหมายเลข #48 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:07:15'),
(69, 9, 'อัปเดตสถานะคำสั่งซื้อ #49', 'คำสั่งซื้อหมายเลข #49 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:08:52'),
(70, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #50', 'มีคำสั่งซื้อใหม่เข้ามา #50 จากคุณ DD ยอดชำระ ฿130', 'admin_orders.php', 1, 1, '2026-06-04 13:09:03'),
(71, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #51', 'มีคำสั่งซื้อใหม่เข้ามา #51 จากคุณ DD ยอดชำระ ฿110', 'admin_orders.php', 1, 1, '2026-06-04 13:09:55'),
(72, 9, 'อัปเดตสถานะคำสั่งซื้อ #51', 'คำสั่งซื้อหมายเลข #51 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:11:23'),
(73, 9, 'อัปเดตสถานะคำสั่งซื้อ #50', 'คำสั่งซื้อหมายเลข #50 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:11:24'),
(74, 9, 'อัปเดตสถานะคำสั่งซื้อ #50', 'คำสั่งซื้อหมายเลข #50 ของคุณเปลี่ยนสถานะเป็น: รอการตรวจสอบชำระเงิน', 'my_orders.php', 0, 0, '2026-06-04 13:11:26'),
(75, 9, 'อัปเดตสถานะคำสั่งซื้อ #50', 'คำสั่งซื้อหมายเลข #50 ของคุณเปลี่ยนสถานะเป็น: ถูกยกเลิกแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:11:27'),
(76, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #52', 'มีคำสั่งซื้อใหม่เข้ามา #52 จากคุณ DD ยอดชำระ ฿110', 'admin_orders.php', 1, 1, '2026-06-04 13:12:56'),
(77, NULL, 'มีคำสั่งซื้อใหม่เข้ามา #53', 'มีคำสั่งซื้อใหม่เข้ามา #53 จากคุณ DD ยอดชำระ ฿110', 'admin_orders.php', 1, 1, '2026-06-04 13:13:43'),
(78, 9, 'อัปเดตสถานะคำสั่งซื้อ #53', 'คำสั่งซื้อหมายเลข #53 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:13:51'),
(79, 9, 'อัปเดตสถานะคำสั่งซื้อ #52', 'คำสั่งซื้อหมายเลข #52 ของคุณเปลี่ยนสถานะเป็น: สำเร็จแล้ว', 'my_orders.php', 0, 0, '2026-06-04 13:13:53');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `total_price` decimal(10,2) DEFAULT NULL,
  `discount_amount` decimal(10,2) DEFAULT 0.00,
  `final_price` decimal(10,2) DEFAULT 0.00,
  `coupon_code` varchar(50) DEFAULT NULL,
  `status` enum('pending','approved','shipping','completed','cancelled') DEFAULT 'pending',
  `payment_method` varchar(100) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `payment_slip` varchar(255) DEFAULT NULL,
  `slip_ai_status` enum('pending','verified','mismatch','invalid','skipped','error') DEFAULT NULL,
  `slip_ai_amount` decimal(10,2) DEFAULT NULL,
  `slip_ai_note` text DEFAULT NULL,
  `tracking_no` varchar(100) DEFAULT NULL,
  `shipping_carrier` varchar(100) DEFAULT NULL,
  `order_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `admin_note` text DEFAULT NULL,
  `points_earned` int(11) DEFAULT 0,
  `points_spent` int(11) DEFAULT 0,
  `points_discount` decimal(10,2) DEFAULT 0.00
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `total_price`, `discount_amount`, `final_price`, `coupon_code`, `status`, `payment_method`, `address`, `payment_slip`, `slip_ai_status`, `slip_ai_amount`, `slip_ai_note`, `tracking_no`, `shipping_carrier`, `order_date`, `admin_note`, `points_earned`, `points_spent`, `points_discount`) VALUES
(1, 2, 1500.00, 0.00, 0.00, NULL, 'shipping', NULL, NULL, NULL, NULL, NULL, NULL, 'ไม่บอก', NULL, '2026-01-21 08:13:16', NULL, 0, 0, 0.00),
(2, 2, 500.00, 50.00, 450.00, 'SALE10', 'shipping', NULL, 'คมสัน  (0919922031)\n107 หมู่7 ป่าหว้าน แขวง/ตำบล เชียงเครือ เขต/อำเภอ เมือง จ.สกลนคร 47000', '', NULL, NULL, NULL, 'TH-4124545-414584', NULL, '2026-01-21 08:39:58', NULL, 0, 0, 0.00),
(3, 2, 500.00, 0.00, 500.00, '', 'cancelled', NULL, 'คมสัน  (0919922031)\n110 หมู่ 5 แขวง/ตำบล เชียงเครือ เขต/อำเภอ เมือง จ.สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-21 09:03:15', NULL, 0, 0, 0.00),
(4, 2, 1000.00, 0.00, 1000.00, '', 'cancelled', NULL, 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', 'slip_697097c776b81.jpg', NULL, NULL, NULL, NULL, NULL, '2026-01-21 09:09:27', NULL, 0, 0, 0.00),
(5, 2, 500.00, 0.00, 500.00, '', 'cancelled', NULL, 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', 'slip_69709895a0535.jpg', NULL, NULL, NULL, NULL, NULL, '2026-01-21 09:12:53', NULL, 0, 0, 0.00),
(6, 2, 500.00, 0.00, 500.00, '', 'approved', NULL, 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', 'slip_697098b42847f.jpg', NULL, NULL, NULL, NULL, NULL, '2026-01-21 09:13:24', NULL, 0, 0, 0.00),
(7, 2, 500.00, 0.00, 500.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-21 10:04:25', NULL, 0, 0, 0.00),
(8, 2, 5200.00, 520.00, 4680.00, 'SALE10', 'cancelled', 'นาย คมสัน บุญเขียน', 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', 'slip_6970ad897ef73.jpg', NULL, NULL, NULL, NULL, NULL, '2026-01-21 10:42:17', NULL, 0, 0, 0.00),
(9, 2, 5.00, 0.00, 5.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-21 10:56:20', NULL, 0, 0, 0.00),
(10, 2, 5.00, 0.00, 5.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-21 10:56:33', NULL, 0, 0, 0.00),
(11, 2, 5.00, 0.00, 5.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n110 หมู่ 5 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-21 10:56:59', NULL, 0, 0, 0.00),
(12, 9, 5200.00, 0.00, 5200.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-21 11:32:08', NULL, 0, 0, 0.00),
(13, 9, 5.00, 0.00, 5.00, '', 'shipping', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, 'TH-4124545-414584', NULL, '2026-01-21 11:35:42', NULL, 0, 0, 0.00),
(14, 10, 7700.00, 0.00, 7700.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-23 14:59:37', NULL, 0, 0, 0.00),
(15, 9, 2500.00, 0.00, 2500.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-01-23 15:39:48', NULL, 0, 0, 0.00),
(16, 9, 15200.00, 0.00, 15200.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-07 15:47:14', NULL, 0, 0, 0.00),
(17, 9, 2500.00, 0.00, 2500.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-07 15:49:17', NULL, 0, 0, 0.00),
(18, 9, 200.00, 0.00, 200.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-07 15:51:09', NULL, 0, 0, 0.00),
(19, 9, 1.00, 5000.00, 0.00, 'เอก', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-09 17:00:20', NULL, 0, 0, 0.00),
(20, 9, 1.00, 5000.00, 0.00, 'เอก', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-09 17:20:10', NULL, 0, 0, 0.00),
(21, 9, 1.00, 0.10, 0.90, 'SALE10', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-09 17:21:27', NULL, 0, 0, 0.00),
(22, 9, 5200.00, 5000.00, 200.00, 'เอก', 'cancelled', 'นาย คมสัน บุญเขียน', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', 'slip_698c4da4390e2.png', NULL, NULL, NULL, NULL, NULL, '2026-02-11 09:36:36', 'ลูกค้าติดต่อร้านเพื่อคือสินค้าได้', 0, 0, 0.00),
(23, 9, 2500.00, 5000.00, 0.00, 'เอก', 'cancelled', 'นาย คมสัน บุญเขียน', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', 'slip_698c59a526675.jpg', NULL, NULL, NULL, NULL, NULL, '2026-02-11 10:27:49', NULL, 0, 0, 0.00),
(24, 9, 5200.00, 0.00, 5200.00, '', 'cancelled', 'นาย คมสัน บุญเขียน', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', 'slip_698c5a0383e98.jpg', NULL, NULL, NULL, NULL, NULL, '2026-02-11 10:29:23', 'ระวังของแตก', 0, 0, 0.00),
(25, 9, 447.00, 0.00, 447.00, '', 'shipping', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, 'TH-4124545-4654045601', NULL, '2026-02-12 15:30:10', 'ระวังของแตก', 0, 0, 0.00),
(26, 9, 1390.00, 0.00, 1390.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0660100839)\n107 424523 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-13 15:52:09', NULL, 0, 0, 0.00),
(27, 9, 1390.00, 0.00, 1390.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107\r\nบ้านป่าหว้าน เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, 'TH-4124545-465', NULL, '2026-02-16 16:52:02', 'รักลูกค้านะอิอิ', 0, 0, 0.00),
(28, 9, 149.00, 0.00, 149.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-17 14:02:52', NULL, 0, 0, 0.00),
(29, 9, 1390.00, 0.00, 1390.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-17 14:31:58', NULL, 0, 0, 0.00),
(30, 9, 250.00, 0.00, 250.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-17 14:36:01', NULL, 0, 0, 0.00),
(31, 9, 1390.00, 0.00, 1390.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-17 14:37:01', NULL, 0, 0, 0.00),
(32, 9, 1390.00, 0.00, 1390.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-02-17 14:41:52', NULL, 0, 0, 0.00),
(33, 10, 199.00, 0.00, 199.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, 'ED 1234 5678 9 TH', NULL, '2026-05-28 03:43:33', NULL, 0, 0, 0.00),
(34, 9, 82.00, 9.84, 72.16, 'D', 'completed', 'พร้อมเพย์ (PromptPay)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', 'slip_6a17ddb20b638.jpg', NULL, NULL, NULL, 'ED 1234 4678 9 TH', NULL, '2026-05-28 06:16:18', NULL, 0, 0, 0.00),
(35, 9, 398.00, 47.76, 350.24, 'D', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-05-29 08:44:20', NULL, 0, 0, 0.00),
(36, 10, 199.00, 0.00, 199.00, '', 'shipping', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, 'TH123525423', NULL, '2026-05-29 08:50:03', NULL, 0, 0, 0.00),
(37, 9, 41.00, 4.92, 36.08, 'D', 'completed', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-05-29 17:23:47', NULL, 0, 0, 0.00),
(38, 9, 60.00, 7.20, 52.80, 'D', 'shipping', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, 'TH 451245 441245', NULL, '2026-05-29 17:34:28', NULL, 0, 0, 0.00),
(39, 10, 50.00, 0.00, 50.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-05-29 17:51:40', NULL, 0, 0, 0.00),
(40, 10, 50.00, 0.00, 50.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107 เชียงเครือ เมือง สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-05-29 17:52:15', NULL, 0, 0, 0.00),
(41, 9, 90.00, 0.00, 90.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-05-29 18:44:21', NULL, 0, 0, 0.00),
(42, 9, 702.00, 100.00, 102.00, 'NEWUSER', 'shipping', 'เก็บเงินปลายทาง (COD)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', '', NULL, NULL, NULL, 'ED140802776TH', 'kerry', '2026-05-30 13:30:13', NULL, 1, 500, 500.00),
(43, 9, 54.00, 0.00, 54.00, 'FREE', 'cancelled', 'พร้อมเพย์ (PromptPay)', 'คมสัน  (0919922031)\n107456456\r\nบ้านป่าหว้าน 1101 50545 สกลนคร 47000', 'slip_6a1e8a52ad25c.jpg', 'invalid', 15.00, 'พบสลิปโอนเงินสำเร็จจากธนาคารกรุงไทย ยอดเงิน 15.00 บาท ผู้รับโอนคือ สุขสันต์ มิ่งขวัญ ไม่ตรงกับ คมสัน บุญเขียน | ผู้รับ: สุขสันต์ มิ่งขวัญ | ผู้รับไม่ตรง', NULL, NULL, '2026-06-02 07:46:26', NULL, 0, 0, 0.00),
(44, 9, 50.00, 0.00, 0.00, 'FREE', 'shipping', 'เก็บเงินปลายทาง (COD)', 'คมสัน บุญเขียน (0919922031)\n107 หมู่7  เชียงเครือ เมืองสกลนคร สกลนคร 47000', '', NULL, NULL, NULL, NULL, NULL, '2026-06-03 07:07:21', NULL, 0, 50, 50.00),
(45, 9, 174.00, 0.00, 174.00, 'FREE', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 09:53:12', NULL, 1, 0, 0.00),
(46, 9, 63.00, 0.00, 63.00, 'FREE', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 09:57:37', NULL, 0, 0, 0.00),
(47, 9, 70.00, 7.00, 123.00, 'SALE10', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 13:03:41', NULL, 1, 0, 0.00),
(48, 9, 179.00, 0.00, 179.00, 'FREE', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 13:04:26', NULL, 1, 0, 0.00),
(49, 9, 70.00, 0.00, 130.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 13:06:56', NULL, 1, 0, 0.00),
(50, 9, 70.00, 0.00, 130.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 13:09:03', NULL, 1, 0, 0.00),
(51, 9, 50.00, 0.00, 110.00, '', 'cancelled', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 13:09:54', NULL, 1, 0, 0.00),
(52, 9, 50.00, 0.00, 110.00, '', 'completed', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', 'invalid', 15.00, 'พบสลิปโอนเงินสำเร็จจากธนาคารกรุงไทย ยอดเงิน 15.00 บาท โอนไปยัง สุขสันต์ มิ่งขวัญ ซึ่งไม่ตรงกับชื่อผู้รับเงินที่คาดหวัง', NULL, NULL, '2026-06-04 13:12:55', NULL, 1, 0, 0.00),
(53, 9, 50.00, 0.00, 110.00, '', 'completed', 'เก็บเงินปลายทาง (COD)', 'DD (0919922031)\n104/25  นาโพธิ์ กุสุมาลย์ สกลนคร 47210', '', NULL, NULL, NULL, NULL, NULL, '2026-06-04 13:13:43', NULL, 1, 0, 0.00);

-- --------------------------------------------------------

--
-- Table structure for table `order_items`
--

CREATE TABLE `order_items` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `import_cost` decimal(10,2) DEFAULT 0.00,
  `selected_option` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `quantity`, `price`, `import_cost`, `selected_option`) VALUES
(1, 8, 3, 1, 5200.00, 0.00, NULL),
(2, 9, 4, 1, 5.00, 3.50, NULL),
(3, 10, 4, 1, 5.00, 3.50, NULL),
(4, 11, 4, 1, 5.00, 3.50, NULL),
(5, 12, 3, 1, 5200.00, 0.00, NULL),
(6, 13, 4, 1, 5.00, 3.50, NULL),
(7, 14, 3, 1, 5200.00, 0.00, NULL),
(8, 14, 2, 1, 2500.00, 0.00, NULL),
(9, 15, 2, 1, 2500.00, 0.00, NULL),
(10, 16, 3, 1, 5200.00, 0.00, NULL),
(11, 16, 2, 4, 2500.00, 0.00, NULL),
(12, 17, 2, 1, 2500.00, 0.00, NULL),
(13, 18, 5, 1, 200.00, 140.00, NULL),
(14, 19, 6, 1, 1.00, 0.70, NULL),
(15, 20, 6, 1, 1.00, 0.70, NULL),
(16, 21, 6, 1, 1.00, 0.70, NULL),
(17, 22, 3, 1, 5200.00, 0.00, NULL),
(18, 23, 2, 1, 2500.00, 0.00, NULL),
(19, 24, 3, 1, 5200.00, 0.00, NULL),
(20, 25, 14, 1, 328.00, 229.60, 'น้ำหนัก: 15โล'),
(21, 25, 12, 1, 119.00, 83.30, ''),
(22, 27, 23, 1, 1390.00, 0.00, 'สี: ดำ'),
(23, 28, 24, 1, 149.00, 0.00, 'สี: เขียว'),
(24, 29, 23, 1, 1390.00, 0.00, 'สี: ดำ'),
(25, 30, 22, 1, 250.00, 0.00, 'สี: เทา'),
(26, 31, 23, 1, 1390.00, 0.00, 'สี: ดำ'),
(27, 32, 23, 1, 1390.00, 0.00, 'สี: ดำ'),
(28, 33, 31, 1, 199.00, 0.00, ''),
(29, 34, 28, 1, 36.00, 0.00, ''),
(30, 34, 27, 1, 46.00, 0.00, ''),
(31, 35, 31, 2, 199.00, 0.00, ''),
(32, 36, 31, 1, 199.00, 0.00, ''),
(33, 37, 27, 1, 41.00, 0.00, ''),
(34, 38, 30, 1, 60.00, 0.00, ''),
(35, 39, 32, 1, 50.00, 45.00, 'สี: แดง'),
(36, 40, 32, 1, 50.00, 45.00, 'สี: แดง'),
(37, 41, 32, 2, 45.00, 45.00, 'สี: แดง'),
(38, 42, 29, 1, 250.00, 0.00, ''),
(39, 42, 31, 2, 199.00, 0.00, ''),
(40, 42, 30, 1, 54.00, 0.00, ''),
(41, 43, 30, 1, 54.00, 0.00, ''),
(42, 44, 32, 1, 50.00, 45.00, 'สี: แดง'),
(43, 45, 32, 1, 50.00, 45.00, 'สี: แดง'),
(44, 45, 33, 1, 70.00, 50.00, ''),
(45, 45, 30, 1, 54.00, 0.00, ''),
(46, 46, 33, 1, 63.00, 50.00, ''),
(47, 47, 33, 1, 70.00, 50.00, ''),
(48, 48, 31, 1, 179.00, 0.00, ''),
(49, 49, 33, 1, 70.00, 50.00, ''),
(50, 50, 33, 1, 70.00, 50.00, ''),
(51, 51, 32, 1, 50.00, 45.00, 'สี: แดง'),
(52, 52, 32, 1, 50.00, 45.00, 'สี: แดง'),
(53, 53, 32, 1, 50.00, 45.00, 'สี: ส้ม');

-- --------------------------------------------------------

--
-- Table structure for table `payment_methods`
--

CREATE TABLE `payment_methods` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `type` enum('bank','promptpay','cod') NOT NULL,
  `account_number` varchar(50) DEFAULT NULL,
  `account_name` varchar(100) DEFAULT NULL,
  `status` enum('active','inactive') DEFAULT 'active'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `payment_methods`
--

INSERT INTO `payment_methods` (`id`, `name`, `type`, `account_number`, `account_name`, `status`) VALUES
(2, 'เก็บเงินปลายทาง (COD)', 'cod', '-', '-', 'active'),
(5, 'พร้อมเพย์ (PromptPay)', 'promptpay', '0919922031', 'คมสัน บุญเขียน', 'active'),
(6, 'ธนาคารกรุงไทย', 'bank', '6601077682', 'คมสัน บุญเขียน', 'active');

-- --------------------------------------------------------

--
-- Table structure for table `point_history`
--

CREATE TABLE `point_history` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `points` int(11) NOT NULL,
  `description` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `point_history`
--

INSERT INTO `point_history` (`id`, `user_id`, `points`, `description`, `created_at`) VALUES
(1, 10, 50, 'ผู้ดูแลระบบแก้ไขแต้มสะสมโดยตรง (จาก 0 เป็น 50 แต้ม)', '2026-05-30 17:38:20'),
(2, 9, -50, 'ใช้คะแนนแลกส่วนลดในออเดอร์ #44', '2026-06-03 07:07:21'),
(3, 9, -1300, 'ผู้ดูแลระบบแก้ไขแต้มสะสมโดยตรง (จาก 1450 เป็น 150 แต้ม)', '2026-06-04 06:43:45'),
(4, 9, 1, 'ได้รับคะแนนสะสมจากคำสั่งซื้อสำเร็จ #53', '2026-06-04 13:13:51'),
(5, 9, 1, 'ได้รับคะแนนสะสมจากคำสั่งซื้อสำเร็จ #52', '2026-06-04 13:13:53');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `category_id` int(11) DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `description` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `stock` int(11) DEFAULT 100,
  `options` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `category_id`, `name`, `price`, `description`, `image`, `stock`, `options`) VALUES
(27, 6, 'ไวไว เส้นหมี่รสหมูสับ (สม.) 6ซอง', 46.00, 'เส้นหมี่กึ่งสำเร็จรูปรสหมูสับ 1 แพ็ค 6 ซอง น้ำหน้ก 55 กรัมต่อซอง\r\n\r\nอ.ย.73-1-05836-2-0008\r\n\r\n\r\n\r\nMinced Pork Flavour Instant Rice Vermicelli WaiWai\r\n\r\nส่วนประกอบที่สำคัญ / Ingredients\r\n\r\nแป้งข้าวเจ้า	Rice Flour	77%\r\n\r\nน้ำมันเจียวกระเทียม	Garlic Oil	7.27%\r\n\r\nเกลือเสริมไอโอดีน	Iodized Salt	5.45%\r\n\r\nเนื้อหมูผง	Dried Pork	2.0%\r\n\r\nรสหมูผง	Pork Flavour	1.36\r\n\r\nแต่งรสเลียนธรรมชาติ ใช้โมโนโซเดียมกลูตาเมตเป็นวัตถุปรุงแต่งรสอาหาร\r\n\r\nไม่ใช้วัตถุกันเสีย\r\n\r\nข้อมูลสำหรับผู้แพ้อาหาร : มีข้าวสาลี, โปรตีนจากถั่วเหลือง อาจมี กุ้ง ปลา ไข่ นม ', 'uploads/prod_69b6d9b864450.webp', 98, ''),
(28, 6, 'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม', 36.00, 'อะยัมปลาแมกเคอเรลในซอสมะเขือเทศ 155กรัม Ayam Mackerel In Tomato Sauce 155g. [หมายเลขบาร์โค้ด 8851826601115 ]', 'uploads/prod_69b6d9e9dbb50.webp', 99, ''),
(29, 6, 'ตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.', 250.00, 'ฉัตรทอง ข้าวขาวหอมมะลิ 100% 5 กก.\r\n\r\n \r\n\r\n ฉัตรทอง ข้าวหอมมะลิ 100% เกรดพรีเมี่ยม ฉัตรทองคัดสรรวัตถุดิบจากแหล่งเพาะปลูกที่ดี เมล็ดเรียวยาว สีขาวนวล หุงอร่อย กลิ่นหอม เนื้อนุ่ม ผลิตด้วยกระบวนการขัดเป็นพิเศษ เมล็ดข้าวจึงสะอาดกว่า และเงาสวยกว่าข้าวธรรมดาถึง 3 เท่า\r\n\r\n \r\n\r\n - ฉัตรทอง ข้าวหอมมะลิ 100% เกรดพรีเมี่ยม ข้าวคุณภาพดีแสนอร่อย\r\n\r\n - สะอาด ปลอดภัย ใส่ใจทุกขั้นตอนในการผลิต\r\n\r\n - หุงอร่อย กลิ่นหอม เนื้อนุ่ม น่ารับประทาน\r\n\r\n - ข้าวหอมมะลิคุณภาพที่ได้รับรางวัล \"Best Rice Award\"\r\n\r\n - เข้ากันได้ดีกับอาหารทุกชนิด รับประทานได้ทุกวัน', 'uploads/prod_69b6da3f66c55.webp', 101, ''),
(30, 7, 'น้ำดื่มคริสตัลขนาด (1500 มล. x 6 ขวด)', 60.00, 'น้ำดื่มคริสตัลขนาด (1500 มล. x 6 ขวด)', 'uploads/prod_69b6da9653c27.webp', 100, ''),
(31, 8, 'จอห์นสัน เบบี้ ครีมอาบน้ำและสระผมเด็ก เบดไทม์ เซล์ฟ โฟมมิ่ง โฟมมิ่ง วอช 400 มล.', 199.00, 'อห์นสัน เบบี้ เบดไทม์ เซลฟ์ โฟมมิ่ง วอช แอนด์ แชมพู\r\n\r\nผลิตภัณฑ์ทำความสะอาดผิวและสระผม\r\n\r\nJOHNSON’S® baby ปกป้องผิวและเส้นผมอันบอบบางของลูกน้อย และช่วงเวลาแห่งความผูกพันอันล้ำค่า\r\n\r\nอาบน้ำอุ่น + นวดสัมผัสอย่างอ่อนโยน + ช่วงเวลาพักผ่อน\r\n\r\n- ผ่านการทดสอบโดยกุมารแพทย์ แพทย์ผิวหนัง และจักษุแพทย์\r\n\r\n- ผ่านการพิสูจน์ทางคลินิกแล้วว่า ปลอดภัยสำหรับผิวเด็กแรกเกิด และผิวบอบบาง\r\n\r\n- ผ่านการทดสอบว่าไม่ก่อให้เกิดการแพ้ และมีค่า pH ที่เหมาะกับผิว\r\n\r\nพิสูจน์ทางคลินิกแล้วว่ากิจวัตรก่อนเข้านอนช่วยให้ลูกน้อยหลับดีขึ้น*\r\n\r\n', 'uploads/prod_69b6dac2cc859.webp', 106, ''),
(32, 8, 'Teto', 50.00, '', 'uploads/prod_6a19d101550fc.jpg', 13, 'สี:แดง,น้ำเงิน,ส้ม'),
(33, 10, 'Miku', 70.00, '', 'uploads/prod_6a211ef499a9f.jpg', 51, '');

-- --------------------------------------------------------

--
-- Table structure for table `product_lots`
--

CREATE TABLE `product_lots` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `lot_number` varchar(50) DEFAULT NULL,
  `import_cost` decimal(10,2) NOT NULL DEFAULT 0.00,
  `price` decimal(10,2) NOT NULL COMMENT 'ราคาขายของล็อตนี้',
  `stock` int(11) NOT NULL COMMENT 'สต๊อกคงเหลือในล็อตนี้',
  `imported_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT 'วันที่นำเข้า'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_lots`
--

INSERT INTO `product_lots` (`id`, `product_id`, `lot_number`, `import_cost`, `price`, `stock`, `imported_at`) VALUES
(18, 27, NULL, 0.00, 46.00, 98, '2026-05-27 18:25:27'),
(19, 28, NULL, 0.00, 36.00, 99, '2026-05-27 18:25:27'),
(20, 29, NULL, 0.00, 250.00, 101, '2026-05-27 18:25:27'),
(21, 30, NULL, 0.00, 60.00, 100, '2026-05-27 18:25:27'),
(22, 31, NULL, 0.00, 199.00, 106, '2026-05-27 18:25:27'),
(32, 23, 'RETURNED', 0.00, 0.00, 5, '2026-05-28 11:41:59'),
(33, 22, 'RETURNED', 0.00, 0.00, 1, '2026-05-29 15:41:23'),
(34, 24, 'RETURNED', 0.00, 0.00, 1, '2026-05-29 15:41:32'),
(35, 3, 'RETURNED', 0.00, 0.00, 4, '2026-05-29 15:43:21'),
(36, 2, 'RETURNED', 0.00, 0.00, 6, '2026-05-29 15:43:30'),
(37, 32, 'LOT-001', 45.00, 50.00, 1, '2026-05-30 00:46:41'),
(38, 32, 'TOL-002', 50.00, 75.00, 12, '2026-05-31 00:04:47'),
(39, 33, '01', 50.00, 70.00, 51, '2026-06-04 13:45:08');

-- --------------------------------------------------------

--
-- Table structure for table `product_reviews`
--

CREATE TABLE `product_reviews` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `rating` int(11) NOT NULL DEFAULT 5,
  `comment` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `product_reviews`
--

INSERT INTO `product_reviews` (`id`, `product_id`, `user_id`, `rating`, `comment`, `image`, `created_at`) VALUES
(1, 14, 9, 2, 'ก็ดีนะ', NULL, '2026-02-12 15:30:51'),
(2, 32, 9, 3, 'น้องน่ารักมากกก', 'uploads/review_6a19df9a53094.jpg', '2026-05-29 18:48:58');

-- --------------------------------------------------------

--
-- Table structure for table `review_votes`
--

CREATE TABLE `review_votes` (
  `id` int(11) NOT NULL,
  `review_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `shop_settings`
--

CREATE TABLE `shop_settings` (
  `id` int(11) NOT NULL,
  `shop_name` varchar(255) NOT NULL,
  `address` text NOT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `shop_email` varchar(255) DEFAULT NULL,
  `print_remark` text DEFAULT NULL,
  `shop_icon` varchar(255) DEFAULT 'default_icon.png',
  `smtp_host` varchar(100) DEFAULT 'smtp.gmail.com',
  `smtp_port` int(11) DEFAULT 587,
  `smtp_user` varchar(100) DEFAULT NULL,
  `smtp_pass` varchar(100) DEFAULT NULL,
  `smtp_secure` varchar(10) DEFAULT 'tls',
  `auto_flash_sale` int(11) DEFAULT 0,
  `auto_flash_discount` int(11) DEFAULT 20,
  `auto_flash_duration` int(11) DEFAULT 2,
  `welcome_promo_enabled` int(11) DEFAULT 1,
  `welcome_promo_coupon` varchar(50) DEFAULT NULL,
  `shipping_fee_fixed` decimal(10,2) DEFAULT 40.00,
  `shipping_free_threshold` decimal(10,2) DEFAULT 350.00,
  `points_earn_rate` int(11) NOT NULL DEFAULT 100,
  `points_spend_rate` int(11) NOT NULL DEFAULT 1,
  `line_notify_token` varchar(255) DEFAULT NULL,
  `openai_api_key` varchar(255) DEFAULT NULL,
  `slip_ai_provider` varchar(50) DEFAULT 'none',
  `gemini_api_key` varchar(255) DEFAULT NULL,
  `claude_api_key` varchar(255) DEFAULT NULL,
  `discord_webhook_url` text DEFAULT NULL,
  `telegram_bot_token` varchar(255) DEFAULT NULL,
  `telegram_chat_id` varchar(100) DEFAULT NULL,
  `slack_webhook_url` text DEFAULT NULL,
  `custom_webhook_url` text DEFAULT NULL,
  `notification_sound` varchar(50) DEFAULT 'chime',
  `auto_flash_type` varchar(20) DEFAULT 'static',
  `auto_flash_min_discount` int(11) DEFAULT 10,
  `auto_flash_max_discount` int(11) DEFAULT 50,
  `auto_flash_selection_rule` varchar(30) DEFAULT 'random',
  `auto_flash_count` int(11) DEFAULT 3,
  `auto_flash_stock` int(11) DEFAULT 10
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `shop_settings`
--

INSERT INTO `shop_settings` (`id`, `shop_name`, `address`, `phone`, `shop_email`, `print_remark`, `shop_icon`, `smtp_host`, `smtp_port`, `smtp_user`, `smtp_pass`, `smtp_secure`, `auto_flash_sale`, `auto_flash_discount`, `auto_flash_duration`, `welcome_promo_enabled`, `welcome_promo_coupon`, `shipping_fee_fixed`, `shipping_free_threshold`, `points_earn_rate`, `points_spend_rate`, `line_notify_token`, `openai_api_key`, `slip_ai_provider`, `gemini_api_key`, `claude_api_key`, `discord_webhook_url`, `telegram_bot_token`, `telegram_chat_id`, `slack_webhook_url`, `custom_webhook_url`, `notification_sound`, `auto_flash_type`, `auto_flash_min_discount`, `auto_flash_max_discount`, `auto_flash_selection_rule`, `auto_flash_count`, `auto_flash_stock`) VALUES
(1, 'Por Mae Bet Taled', '107 หมู่7 ต.เชียงเครือ อ.เมือง จ.สกลนคร 47000', '0919922031', 'ppilovee01@gmail.com', 'กรุณาถ่ายวิดีโอขณะแกะพัสดุ ขอบคุณที่ใช้บริการทางร้าน', 'favicon_1780153082.webp', 'smtp.gmail.com', 587, 'ppilovee01@gmail.com', '', 'tls', 1, 10, 4, 1, 'NEWUSER', 60.00, 550.00, 100, 1, '', '', 'none', 'AQ.Ab8RN6LRqNh7ih9DFQmQyvvhbSFnjit_-5_cWRmRzuuuVG22Tg', '', 'https://discord.com/api/webhooks/1473327005234761760/yOg6j2pYCa0DDSnqUxs5yCL3mlODeIrnYNNo1nJJldGFjnvDHQalkSHzd6RM0691w-b4', '', '', '', '', 'chime', 'dynamic', 10, 30, 'slow_moving', 4, 10);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `fullname` varchar(100) DEFAULT NULL,
  `email` varchar(100) NOT NULL,
  `role` enum('admin','user') DEFAULT 'user',
  `created_at` datetime DEFAULT current_timestamp(),
  `reset_token` varchar(255) DEFAULT NULL,
  `reset_expiry` datetime DEFAULT NULL,
  `points` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `fullname`, `email`, `role`, `created_at`, `reset_token`, `reset_expiry`, `points`) VALUES
(9, 'a', '$2y$10$SCtHukEPRxTlwE3nDR7wIux2143gQhZthQwwoe4ag80WjCcKqhDBq', 'ไม่บอก', 'ppilovee01@gmail.com', 'admin', '2026-02-10 00:40:54', NULL, NULL, 152),
(10, 's', '$2y$10$o1BY9zf24Q0MxqiJnUV7xe9Mmvj/3nx73RuFnDggq.9T5C3nqrVxy', 's', 'ppilovee02@gmail.com', 'user', '2026-02-10 00:40:54', NULL, NULL, 50),
(11, 'd', '$2y$10$ygD9gYKx0aG943rGz2u5UOKPsL6yF9aAxkvCANDnq.r5EsfrW/D36', 'd', 'd@d.com', 'user', '2026-02-10 00:40:54', NULL, NULL, 0);

-- --------------------------------------------------------

--
-- Table structure for table `user_addresses`
--

CREATE TABLE `user_addresses` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `recipient_name` varchar(100) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `address_line1` varchar(255) DEFAULT NULL,
  `subdistrict` varchar(100) DEFAULT NULL,
  `district` varchar(100) DEFAULT NULL,
  `province` varchar(100) DEFAULT NULL,
  `zipcode` varchar(10) DEFAULT NULL,
  `is_default` tinyint(4) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `user_addresses`
--

INSERT INTO `user_addresses` (`id`, `user_id`, `recipient_name`, `phone`, `address_line1`, `subdistrict`, `district`, `province`, `zipcode`, `is_default`) VALUES
(1, 2, 'คมสัน ', '0919922031', '107 หมู่7 ป่าหว้าน', 'เชียงเครือ', 'เมือง', 'สกลนคร', '47000', 0),
(2, 2, 'คมสัน ', '0919922031', '110 หมู่ 5', 'เชียงเครือ', 'เมือง', 'สกลนคร', '47000', 0),
(7, 10, 'คมสัน ', '0919922031', '107', 'เชียงเครือ', 'เมือง', 'สกลนคร', '47000', 0),
(17, 9, 'คมสัน บุญเขียน', '0919922031', '107 หมู่7 ', 'เชียงเครือ', 'เมืองสกลนคร', 'สกลนคร', '47000', 0),
(18, 9, 'DD', '0919922031', '104/25 ', 'นาโพธิ์', 'กุสุมาลย์', 'สกลนคร', '47210', 0);

-- --------------------------------------------------------

--
-- Table structure for table `wishlist`
--

CREATE TABLE `wishlist` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `wishlist`
--

INSERT INTO `wishlist` (`id`, `user_id`, `product_id`, `created_at`) VALUES
(22, 9, 24, '2026-02-16 15:24:25'),
(23, 9, 23, '2026-02-16 15:24:26'),
(24, 9, 22, '2026-02-16 15:24:34'),
(25, 9, 21, '2026-02-16 15:24:35');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `about_content`
--
ALTER TABLE `about_content`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `admin_logs`
--
ALTER TABLE `admin_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `banners`
--
ALTER TABLE `banners`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_messages`
--
ALTER TABLE `contact_messages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `coupons`
--
ALTER TABLE `coupons`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`);

--
-- Indexes for table `feedback`
--
ALTER TABLE `feedback`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `flash_sales`
--
ALTER TABLE `flash_sales`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_id` (`order_id`);

--
-- Indexes for table `payment_methods`
--
ALTER TABLE `payment_methods`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `point_history`
--
ALTER TABLE `point_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_lots`
--
ALTER TABLE `product_lots`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_reviews`
--
ALTER TABLE `product_reviews`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `review_votes`
--
ALTER TABLE `review_votes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_review_user` (`review_id`,`user_id`);

--
-- Indexes for table `shop_settings`
--
ALTER TABLE `shop_settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `user_addresses`
--
ALTER TABLE `user_addresses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `wishlist`
--
ALTER TABLE `wishlist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id` (`user_id`,`product_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin_logs`
--
ALTER TABLE `admin_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT for table `banners`
--
ALTER TABLE `banners`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `contact_messages`
--
ALTER TABLE `contact_messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `coupons`
--
ALTER TABLE `coupons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `feedback`
--
ALTER TABLE `feedback`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `flash_sales`
--
ALTER TABLE `flash_sales`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `payment_methods`
--
ALTER TABLE `payment_methods`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `point_history`
--
ALTER TABLE `point_history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `product_lots`
--
ALTER TABLE `product_lots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `product_reviews`
--
ALTER TABLE `product_reviews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `review_votes`
--
ALTER TABLE `review_votes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `shop_settings`
--
ALTER TABLE `shop_settings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `user_addresses`
--
ALTER TABLE `user_addresses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `wishlist`
--
ALTER TABLE `wishlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `review_votes`
--
ALTER TABLE `review_votes`
  ADD CONSTRAINT `review_votes_ibfk_1` FOREIGN KEY (`review_id`) REFERENCES `product_reviews` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
